cf_billing/Documents/бестСчетФактураНаАванс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестСчетФактураНаАванс</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежноеПоручениеВходящееЭЭЮрЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.бестКорректировкаЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПереплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПереплатыНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестСчетФактураНаАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.бестВводНачальныхОстатковЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСтавкиНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДССсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДСВнутри</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестВидыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестВидыРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Авансовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фактический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пеня</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргВидыПодписантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыПодписантов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГарантирующийПоставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДиректорПоРаботеСПотребителями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальникЮУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/бестВидыЭлектронногоВзаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестВидыЭлектронногоВзаимодействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БумажныйНоситель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/бестПлатежноеПоручениеВходящееЭЭЮрЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестПлатежноеПоручениеВходящееЭЭЮрЛица</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бестВзаиморасчетыПоПениЭЭ</xr:Item>
				<xr:Item>InformationRegister.бестИсторияОплатыЮрЛиц</xr:Item>
				<xr:Item>AccumulationRegister.бестАвансыЭЭ</xr:Item>
				<xr:Item>AccumulationRegister.бестСуммыОплатЭЭ</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчетыЭЭ</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчетыПоАвансовымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчетыПоМесяцамЭЭ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РООтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестВводНачальныхОстатковЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НеЗагруженныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументНачисления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестСчетФактураНаАванс/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 				= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 			= КоллекцияПечатныхФорм[0].СинонимМакета;
	
	Если ИмяМакета = "ПФ_MXL_СчетФактураНаАванс" Тогда
		ТабличныйДокумент 		= СформироватьСчетФактураНаАванс(ИмяМакета, ПараметрыПечати);	
	КонецЕсли;
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета, СинонимМакета,
		ТабличныйДокумент, ,
		"Документ.бестСчетФактураНаАванс." + ИмяМакета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСчетФактураНаАванс(ИмяМакета, ПараметрыПечати)
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Документ.бестСчетФактураНаАванс." +ИмяМакета);
	
	ТабДок 									= Новый ТабличныйДокумент;
	
	ОбластьСФНаАванс  = Макет.ПолучитьОбласть("СФНаАванс");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестСчетФактураНаАванс.Организация КАК Организация,
	|	бестСчетФактураНаАванс.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	бестСчетФактураНаАванс.Дата КАК Дата,
	|	бестСчетФактураНаАванс.Район КАК Район,
	|	бестСчетФактураНаАванс.Договор КАК Договор,
	|	бестСчетФактураНаАванс.СуммаПереплаты КАК СуммаСНДС,
	|	бестСчетФактураНаАванс.СуммаПереплатыНДС КАК СуммаНДС,
	|	ЕСТЬNULL(бестСтавкиНДССрезПоследних.СтавкаНДС, 0) КАК СтавкаНДС,
	|	бестСчетФактураНаАванс.ПериодНачисления КАК ПериодНачисления,
	|	бестСчетФактураНаАванс.Ответственный КАК Ответственный,
	|	бестСчетФактураНаАванс.IDСтрокиОплаты КАК IDСтрокиОплаты,
	|	бестСчетФактураНаАванс.ДокументОплаты КАК ДокументОплаты
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестСчетФактураНаАванс КАК бестСчетФактураНаАванс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСтавкиНДС.СрезПоследних(&Период, ) КАК бестСтавкиНДССрезПоследних
	|		ПО бестСчетФактураНаАванс.Организация = бестСтавкиНДССрезПоследних.Организация
	|ГДЕ
	|	бестСчетФактураНаАванс.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления КАК ДокументНачисления,
	|	КОЛИЧЕСТВО(бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления) КАК КолвоПД,
	|	бестПлатежныйДокумент.ТипЗадолженности КАК ТипЗадолженности,
	|	бестПлатежныйДокумент.Процент КАК Процент,
	|	ДанныеДокумента.IDСтрокиОплаты КАК IDСтрокиОплаты
	|ПОМЕСТИТЬ ПД
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.ДокументыНачисления КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|			ПО бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления = бестПлатежныйДокумент.Ссылка
	|		ПО ДанныеДокумента.ДокументОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.Ссылка
	|			И ДанныеДокумента.IDСтрокиОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.IDСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления,
	|	бестПлатежныйДокумент.ТипЗадолженности,
	|	бестПлатежныйДокумент.Процент,
	|	ДанныеДокумента.IDСтрокиОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ДанныеДокумента.Дата КАК ДатаСФ,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	Организации.ИНН КАК ИННОрг,
	|	Организации.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ФактическийАдресОрг,
	|	ОрганизацииКонтактнаяИнформация1.Представление КАК ЮридическийАдресОрг,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактическийАдресКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргЗоныОтвественности.КодРайона КАК КодРайона,
	|	ДанныеДокумента.СуммаСНДС - ДанныеДокумента.СуммаНДС КАК СуммаБезНДС,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	ПользователиКонтактнаяИнформация.Представление КАК ОтветственныйТелефон,
	|	ПользователиКонтактнаяИнформация1.Представление КАК ОтветственныйПочта,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	ЕСТЬNULL(ПД.Процент, -1) КАК Процент,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ПО ДанныеДокумента.Район = энргЗоныОтвественности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДанныеДокумента.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация1.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|				ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|					И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПД КАК ПД
	|		ПО ДанныеДокумента.IDСтрокиОплаты = ПД.IDСтрокиОплаты
	|			И (ПД.КолвоПД = 1)
	|			И (ПД.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Авансовый))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	Итог.ДатаСФ КАК ДатаСФ,
	|	Итог.ИННОрг КАК ИННОрг,
	|	Итог.КППОрг КАК КППОрг,
	|	Итог.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
	|	Итог.ФактическийАдресОрг КАК ФактическийАдресОрг,
	|	Итог.ЮридическийАдресОрг КАК ЮридическийАдресОрг,
	|	Итог.ФактическийАдресКонтрагента КАК ФактическийАдресКонтрагента,
	|	Итог.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.КодРайона КАК КодРайона,
	|	Итог.ИННКон КАК ИННКон,
	|	Итог.КППКон КАК КППКон,
	|	Итог.ОтветственныйТелефон КАК ОтветственныйТелефон,
	|	Итог.ОтветственныйПочта КАК ОтветственныйПочта,
	|	Итог.Ответственный КАК Ответственный,
	|	Итог.СуммаСНДС КАК СуммаСНДС,
	|	Итог.СуммаНДС КАК СуммаНДС,
	|	Итог.СтавкаНДС КАК СтавкаНДС,
	|	Итог.Процент КАК Процент,
	|	Итог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие
	|ИЗ
	|	Итог КАК Итог";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	Запрос.УстановитьПараметр("Период", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.ОбъектПечати, "Дата"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка 			= РезультатЗапроса[3].Выбрать();
	
	ЭлектронноеВзаимодействие = Неопределено;
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьСФНаАванс.Параметры,Выборка);
		ОбластьСФНаАванс.Параметры.ДатаСФ = Формат(Выборка.ДатаСФ, "ДЛФ=D");
		ОбластьСФНаАванс.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=D");
		ТекстЕслиПДАвансовый = "Оплата за электроэнергию по постановлению правительства РФ №442";
		Если Выборка.Процент >= 0 Тогда
			ТекстЕслиПДАвансовый = ТекстЕслиПДАвансовый + " - " + Выборка.Процент + "% стоимости электроэнергии (мощности)";
		КонецЕсли;
		ОбластьСФНаАванс.Параметры.ТекстЕслиПДАвансовый = ТекстЕслиПДАвансовый;
		ЭлектронноеВзаимодействие = Выборка.ЭлектронноеВзаимодействие;
	КонецЕсли;
	
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьСФНаАванс.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьСФНаАванс.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьСФНаАванс.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьСФНаАванс.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = Документы.бестПлатежныйДокумент.ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьСФНаАванс.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
			КонецЕсли;	
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьСФНаАванс.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
			ОбластьСФНаАванс.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьСФНаАванс.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьСФНаАванс.Параметры.ГлавныйБухгалтерДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = Документы.бестПлатежныйДокумент.ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьСФНаАванс.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТабДок.Вывести(ОбластьСФНаАванс);
	Возврат ТабДок;
КонецФункции

#КонецОбласти

#КонецЕсли
